fa-xbrl/src/ChartsOfCharacteristicTypes/velpo_SourceQueryComponents/velpo_SourceQueryComponents.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>velpo_SourceQueryComponents</name>
  <type>
    <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    <types>CatalogRef.velpo_BusinessUnits</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>CatalogRef.velpo_MemberValues</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>32</precision>
      <scale>10</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>500</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ComponentType</name>
    <type>
      <types>EnumRef.velpo_ComponetQueryTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IndexNum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsScript</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ConstantValue</name>
    <type>
      <types>Characteristic.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>UseDefaults</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Defaults</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>Quarterly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>FunctionFields</name>
    <attributes>
      <name>Field</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SourceParameters</name>
    <attributes>
      <name>Parameter</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.velpo_UserDefinedParameters</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SourceResults</name>
    <attributes>
      <name>Result</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>254</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EntryPoints</name>
    <attributes>
      <name>Taxonomy</name>
      <type>
        <types>CatalogRef.velpo_Taxonomies</types>
      </type>
    </attributes>
    <attributes>
      <name>EntryPoint</name>
      <type>
        <types>CatalogRef.velpo_EntryPoints</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

fa-xbrl/src/Enums/velpo_ItemTableTypes/velpo_ItemTableTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>velpo_ItemTableTypes</name>
  <enumValues>
    <name>MainTable</name>
  </enumValues>
  <enumValues>
    <name>CashFlow</name>
  </enumValues>
</mdclass:Enum>

fa-xbrl/src/Catalogs/velpo_ItemLinks/velpo_ItemLinks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>velpo_ItemLinks</name>
  <owners>ChartOfCharacteristicTypes.velpo_SourceQueryComponents</owners>
  <attributes>
    <name>LinkType</name>
    <type>
      <types>EnumRef.velpo_ItemLinkTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.velpo_Economic</types>
    </type>
  </attributes>
  <attributes>
    <name>Attribute</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_ObjectAttributes</types>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Dimension</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_DimensionIDTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Result</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_SourceQueryComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>TableType</name>
    <type>
      <types>EnumRef.velpo_ItemTableTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>UseSourceValue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AttributeLinks</name>
    <attributes>
      <name>Otherwise</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>FieldValue</name>
      <type>
        <types>Characteristic.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.velpo_ObjectAttributes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DimensionLinks</name>
    <attributes>
      <name>Otherwise</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>FieldValue</name>
      <type>
        <types>Characteristic.velpo_SourceQueryComponents</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.velpo_DimensionIDTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fa-xbrl/src/ChartsOfCharacteristicTypes/velpo_SourceQueryComponents/Forms/OwnFundMapping/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// FA-XBRL, Bookkeeping and XBRL proccessor
//
// @author: Paul Tarasov
//	@email: paul.tarasov@velpo.ru
// 
// Copyright (c) 2021 Paul Tarasov (Velpo)
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Region ServiceProceduresAndFunctions

&AtClientAtServerNoContext
Procedure SetMainFormFilters(Form)

	// import
	CommonClientServer = velpo_CommonFunctionsClientServer;
	ServerCall = velpo_ServerCall;
	
	//vars
	DimensionList = New ValueList;
	PropertyList = New ValueList;
	AccountStructure = ServerCall.GetAccountData(Form.Account);
	
	If AccountStructure.ObjectID <> Undefined Then
		DimensionList.Add(AccountStructure.ObjectID.Ref);
	EndIf;
	
	If Form.TableType = Form.MainTableType Then
		For Each DimensionName In AccountStructure.Dimensions Do
			DimensionList.Add(AccountStructure[DimensionName].Ref);
		EndDo; 
	EndIf;
	
	For Each PropertyName In AccountStructure.Properties Do
		If Form.TableType = Form.CashFlowType 
			And Form.CashFlowAttributes.FindByValue(PropertyName) = Undefined Then
			Continue;
		EndIf;
		PropertyList.Add(AccountStructure[PropertyName].Ref);
	EndDo; 
	
	CommonClientServer.SetDynamicListFilterItem(Form.ItemLinks, "Account",  Form.Account,  DataCompositionComparisonType.Equal, False, True);
	CommonClientServer.SetDynamicListFilterItem(Form.ItemLinks, "TableType",  Form.TableType,  DataCompositionComparisonType.Equal, False, True);
	
	CommonClientServer.SetDynamicListFilterItem(Form.DimensionIDTypes, "Ref",  DimensionList,  DataCompositionComparisonType.InList, False, True);
	CommonClientServer.SetDynamicListFilterItem(Form.ObjectAttributes, "Ref",  PropertyList,  DataCompositionComparisonType.InList, False, True);
	
	CommonClientServer.SetDynamicListParameter(Form.SourceQueryComponents, "Account",  Form.Account,  True);
	CommonClientServer.SetDynamicListParameter(Form.DimensionIDTypes, "Account",  Form.Account,  True);
	CommonClientServer.SetDynamicListParameter(Form.ObjectAttributes, "Account",  Form.Account,  True);
	
	CommonClientServer.SetDynamicListParameter(Form.SourceQueryComponents, "ItemTableType",  Form.TableType,  True);
	CommonClientServer.SetDynamicListParameter(Form.DimensionIDTypes, "ItemTableType",  Form.TableType,  True);
	CommonClientServer.SetDynamicListParameter(Form.ObjectAttributes, "ItemTableType",  Form.TableType,  True);

EndProcedure // SetMainFormFilters()

#EndRegion

#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// import
	ServerCache  = velpo_ServerCache;
	ItemTableTypes = Enums.velpo_ItemTableTypes;
	
	//vars
	CashFlowMap = ServerCache.GetAllCashFlowMap();
	For Each KeyValue In CashFlowMap Do
		ThisForm.CashFlowAttributes.Add(KeyValue.Key);
	EndDo;  
	ThisForm.MainTableType = ItemTableTypes.MainTable;
	ThisForm.CashFlowType = ItemTableTypes.CashFlow;
	ThisForm.TableType = ThisForm.MainTableType;
	
	// set main
	SetMainFormFilters(ThisForm);
	
EndProcedure

#EndRegion

#Region FormCommands

&AtClient
Procedure AddToFields(Command)

	FormParameters = New Structure("Account,Property,TableType");
	FillPropertyValues(FormParameters, ThisForm);
	FormParameters.Insert("Owner", ThisForm.CurrentField);
	FormParameters.Insert("Property", ThisForm.CurrentProperty);
	
	OpenForm("Catalog.velpo_ItemLinks.ObjectForm",
		FormParameters, 
		ThisForm); 
	
EndProcedure

#EndRegion

#Region FormFieldEvents

&AtClient
Procedure AccountOnChange(Item)
	
	SetMainFormFilters(ThisForm);
	
EndProcedure

&AtClient
Procedure ItemTableTypeOnChange(Item)
	
	SetMainFormFilters(ThisForm);
	
EndProcedure

#EndRegion

#Region FormTableEvents

&AtClient
Procedure ListOnActivateRow(Item)
	
	CurrentData = Item.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	ThisForm.CurrentProperty = CurrentData.Ref;
	ThisForm.Items[?(Item.Name = "DimensionIDTypes", "ObjectAttributes", "DimensionIDTypes")].SelectedRows.Clear();
	
EndProcedure

&AtClient
Procedure SourceQueryComponentsOnActivateRow(Item)
	
	CurrentData = Item.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	ThisForm.CurrentField = CurrentData.Ref;
	
EndProcedure

#EndRegion
